Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateRailWarn Property
 Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters, specify "None" for Baluster Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateRailWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateRailWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateRailWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace